---
kind: method
id: M:Autodesk.Revit.DB.AssemblyInstance.Disassemble
source: html/a2c65159-bd72-1a16-f95e-c2a5fac474b0.htm
---
# Autodesk.Revit.DB.AssemblyInstance.Disassemble Method

Removes the assembly instance and releases the member elements.

## Syntax (C#)
```csharp
public ICollection<ElementId> Disassemble()
```

## Returns
ids of elements previously under the assembly instance.